{
  "architectures": [
    "EmageAudioModel"
  ],
  "audio_f": 256,
  "audio_fps": 16000,
  "audio_norm": false,
  "audio_rep": "wave16k",
  "audio_sr": 16000,
  "cf": 0,
  "ch": 1,
  "cl": 1,
  "class_name": "EmageAudioModel",
  "cu": 1,
  "hidden_size": 768,
  "joint_mask": null,
  "lf": 3,
  "lh": 3,
  "ll": 3,
  "lu": 3,
  "model_type": "emage_audio",
  "motion_f": 256,
  "name_pyfile": "models.emage_audio.modeling_emage_audio",
  "pose_dims": 330,
  "pose_fps": 30,
  "pose_length": 64,
  "pose_rep": "smplx",
  "seed_frames": 4,
  "speaker_dims": 1,
  "speaker_f": 768,
  "stride": 20,
  "test_length": 64,
  "torch_dtype": "float32",
  "transformers_version": "4.30.2",
  "vae_codebook_size": 256
}
